// 01. Побудуйте маршрутизатор відповідно до цієї структури
// src/
// ├── components/
// │   ├── Header.tsx           // Навигационное меню с Link/NavLink
// │   ├── Footer.tsx           // Футер страницы
// ├── pages/
// │   ├── HomePage.tsx         // Главная страница
// │   ├── AboutPage.tsx        // Статическая страница "О нас"
// │   ├── ProductsPage.tsx     // Страница со списком продуктов
// │   ├── ProductDetails.tsx   // Страница с подробной информацией о продукте
// │   ├── SearchPage.tsx       // Страница поиска с использованием query string
// │   ├── LoginPage.tsx        // Пример редиректа при логине
// │   └── NotFoundPage.tsx     // Страница 404
// ├── App.tsx                  // Корневой компонент с <Router> и маршрутизацией

// 02. Створіть посилання на сторінки в компоненті Header і розмістіть їх на всіх сторінках будь-яким зручним способом.
// 03. Настройте путь на страницу ProductDetails динамически. Відобразіть на сторінці параметр із шляху поточної сторінки.
// 04. Подивіться завдання по рядку запиту в компоненті searchPage.tsx.
// 05. У компоненті LoginPage налаштуйте кнопку "Увійти" з використанням <Link></Link>, щоб вона перенаправляла користувача на головну сторінку і передавала стан об'єкта {login: "Ви увійшли"}.
// 06. У компоненті LoginPage програмно налаштуйте кнопку "Забули логін", щоб вона перенаправляла користувача на головну сторінку і передавала стан об'єкта {login: "Ви не ввійшли"}.
// 07. На головній сторінці відобразіть значення state login всередині тега <p></p>.
// 08. Перенаправте всі неіснуючі сторінки на головну сторінку.

function App() {
  return <div></div>;
}

export default App;
